import anagramm from './anagramm'

describe('anogramm: ', () => { 
  test('Должен вернуть пустой массив когда переданны некорректные параметры', () => {
      expect(anagramm('aaaa')).toEqual([]);
      expect(anagramm([123,222])).toEqual([]);
      expect(anagramm([])).toEqual([]);
      expect(anagramm(123)).toEqual([]);
  });

  describe('Должен вернуть массив содержащий массивы слов анаграмм,', () => {
    test('когда исходный массив содержит только строки', () => {
      expect(anagramm([
        "вертикаль",
        "кильватер",
        "апельсин",
        "спаниель",
        "австралопитек",
        "ватерполистка",
        "кластер",
        "сталкер",
        "стрелка",
        "корабль"
      ])).toEqual([
            ["вертикаль", "кильватер"],
            ["апельсин", "спаниель"],
            ["австралопитек", "ватерполистка"],
            ["кластер", "сталкер", "стрелка"],
            ["корабль"]
          ]);
    });

    test('когда исходный массив содержит строки разного регистра ', () => {
      expect(anagramm([
        "Полусмерть",
        "пУлЬсОмеТР",
        "сОрАтНиЦа",
        "стационар"
      ])).toEqual([
        [ "Полусмерть", "пУлЬсОмеТР"], 
        [ "сОрАтНиЦа", "стационар"]
      ]);
    }); 

    test('когда исходный массив содержит различные данные', () => {
      expect(anagramm([
        "жалко",
        "полковник",
        "клоповник",
        [2,4,6,3],
        {
          id:1,
          property: '',
        },
        "колаж",
        111,
        "ложка"
      ])).toEqual([
            ["жалко", "колаж", "ложка",],
            ["полковник", "клоповник",]
          ]);
      });
    })
});